Revit 2027 API
DockablePaneId.Inequality Operator
Compares two DockablePaneId instances.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator !=(
	DockablePaneId first,
	DockablePaneId second
)
Public Shared Operator <> (
	first As DockablePaneId,
	second As DockablePaneId
) As Boolean
public:
static bool operator !=(
	DockablePaneId^ first,
	DockablePaneId^ second
)
static let inline (<>)
        first : DockablePaneId *
        second : DockablePaneId  : bool
Parameters
first DockablePaneId
The first DockablePaneId.
second DockablePaneId
The second DockablePaneId.
Return Value
Boolean
True if the inputs are different, false if they are identical.
See Also
Reference
DockablePaneId Class
Autodesk.Revit.UI Namespace